In [2]:
import pandas as pd
import numpy as np
Class_performance = {'names':['joe', 'mark', 'faith', 'ace', 'john', 'lucky'],
                    'Gpa':[88, 78, 73, 73, 72, 71],
                    'rank':[1, 2, 3, 3, 5, 6]}
performance_data = pd.DataFrame(Class_performance)
performance_data

   names  Gpa  rank
0    joe   88     1
1   mark   78     2
2  faith   73     3
3    ace   73     3
4   john   72     5
5  lucky   71     6

In [2]:
performance_data.names

0      joe
1     mark
2    faith
3      ace
4     john
5    lucky
Name: names, dtype: object

In [3]:
performance_data.Gpa

0    88
1    78
2    73
3    73
4    72
5    71
Name: Gpa, dtype: int64

In [18]:
performance_data.set_index('rank')

      names  Gpa
rank
1       joe   88
2      mark   78
3     faith   73
3       ace   73
5      john   72
6     lucky   71

In [5]:
print(pd.__version__)

1.2.4

# index based selection

In [20]:
performance_data.iloc[0]

names    joe
Gpa       88
rank       1
Name: 0, dtype: object

In [4]:
performance_data.iloc[:,0]

0      joe
1     mark
2    faith
3      ace
4     john
5    lucky
Name: names, dtype: object

In [5]:
performance_data.iloc[:3, 1]

0    88
1    78
2    73
Name: Gpa, dtype: int64

 # label based selection

In [16]:
performance_data.loc[:3, ['names','Gpa'] ]

   names  Gpa
0    joe   88
1   mark   78
2  faith   73
3    ace   73

# series

In [8]:
# creating a series from a list
marks = [76,77,78,82,73,79]
c1 = pd.Series(marks)
c1

0    76
1    77
2    78
3    82
4    73
5    79
dtype: int64

In [12]:
rank = [1,2,3,4,5,6]
c2 = pd.Series(marks, index = rank)
c2

1    76
2    77
3    78
4    82
5    73
6    79
dtype: int64

In [13]:
index = ['sco 202', 'sco 204', 'sco 107', 'sma 204', 'sma 203', 'sst 205']
c3 = pd.Series(marks,index = index)
c3

sco 202    76
sco 204    77
sco 107    78
sma 204    82
sma 203    73
sst 205    79
dtype: int64

In [22]:
import numpy as np
numbers = np.random.randn(7)
numbers

array([ 0.58989644, -0.34392485, -0.23323103,  1.15603523, -0.35049902,
        1.02916255, -1.09964305])

In [1]:
# creating series from dictionary
capital_city = {'Kenya':'Nairobi', 'USA':'Washington Dc', 'France': 'Paris'}